Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/ip1553.h
/**
 * \brief Component description for IP1553
 *
 * Copyright (c) 2020 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2020-01-08T10:06:16Z */
#ifndef _SAMRH71_IP1553_COMPONENT_H_
#define _SAMRH71_IP1553_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR IP1553                                       */
/* ************************************************************************** */

/* -------- IP1553_CR : (IP1553 Offset: 0x00) (R/W 32) Configuration Register -------- */
#define IP1553_CR_PT_Pos                      _U_(0)                                               /**< (IP1553_CR) POTermConf Position */
#define IP1553_CR_PT_Msk                      (_U_(0x1) << IP1553_CR_PT_Pos)                       /**< (IP1553_CR) POTermConf Mask */
#define IP1553_CR_PT(value)                   (IP1553_CR_PT_Msk & ((value) << IP1553_CR_PT_Pos))  
#define IP1553_CR_TA_Pos                      _U_(1)                                               /**< (IP1553_CR) TermAddressConf Position */
#define IP1553_CR_TA_Msk                      (_U_(0x1F) << IP1553_CR_TA_Pos)                      /**< (IP1553_CR) TermAddressConf Mask */
#define IP1553_CR_TA(value)                   (IP1553_CR_TA_Msk & ((value) << IP1553_CR_TA_Pos))  
#define IP1553_CR_TC_Pos                      _U_(6)                                               /**< (IP1553_CR) TRBitCmd Position */
#define IP1553_CR_TC_Msk                      (_U_(0x1) << IP1553_CR_TC_Pos)                       /**< (IP1553_CR) TRBitCmd Mask */
#define IP1553_CR_TC(value)                   (IP1553_CR_TC_Msk & ((value) << IP1553_CR_TC_Pos))  
#define IP1553_CR_SC_Pos                      _U_(7)                                               /**< (IP1553_CR) SSBitCmd Position */
#define IP1553_CR_SC_Msk                      (_U_(0x1) << IP1553_CR_SC_Pos)                       /**< (IP1553_CR) SSBitCmd Mask */
#define IP1553_CR_SC(value)                   (IP1553_CR_SC_Msk & ((value) << IP1553_CR_SC_Pos))  
#define IP1553_CR_BC_Pos                      _U_(8)                                               /**< (IP1553_CR) BusyBitCmd Position */
#define IP1553_CR_BC_Msk                      (_U_(0x1) << IP1553_CR_BC_Pos)                       /**< (IP1553_CR) BusyBitCmd Mask */
#define IP1553_CR_BC(value)                   (IP1553_CR_BC_Msk & ((value) << IP1553_CR_BC_Pos))  
#define IP1553_CR_SRC_Pos                     _U_(9)                                               /**< (IP1553_CR) SREQBitCmd Position */
#define IP1553_CR_SRC_Msk                     (_U_(0x1) << IP1553_CR_SRC_Pos)                      /**< (IP1553_CR) SREQBitCmd Mask */
#define IP1553_CR_SRC(value)                  (IP1553_CR_SRC_Msk & ((value) << IP1553_CR_SRC_Pos))
#define IP1553_CR_BEC_Pos                     _U_(10)                                              /**< (IP1553_CR) BCEnableCmd Position */
#define IP1553_CR_BEC_Msk                     (_U_(0x1) << IP1553_CR_BEC_Pos)                      /**< (IP1553_CR) BCEnableCmd Mask */
#define IP1553_CR_BEC(value)                  (IP1553_CR_BEC_Msk & ((value) << IP1553_CR_BEC_Pos))
#define IP1553_CR_RST_Pos                     _U_(11)                                              /**< (IP1553_CR) Soft Reset Position */
#define IP1553_CR_RST_Msk                     (_U_(0x1) << IP1553_CR_RST_Pos)                      /**< (IP1553_CR) Soft Reset Mask */
#define IP1553_CR_RST(value)                  (IP1553_CR_RST_Msk & ((value) << IP1553_CR_RST_Pos))
#define IP1553_CR_Msk                         _U_(0x00000FFF)                                      /**< (IP1553_CR) Register Mask  */


/* -------- IP1553_CMDR1 : (IP1553 Offset: 0x0C) ( /W 32) Command Register 1 -------- */
#define IP1553_CMDR1_DATAWORDCOUNT_Pos        _U_(0)                                               /**< (IP1553_CMDR1) DATA WORD COUNT Position */
#define IP1553_CMDR1_DATAWORDCOUNT_Msk        (_U_(0x1F) << IP1553_CMDR1_DATAWORDCOUNT_Pos)        /**< (IP1553_CMDR1) DATA WORD COUNT Mask */
#define IP1553_CMDR1_DATAWORDCOUNT(value)     (IP1553_CMDR1_DATAWORDCOUNT_Msk & ((value) << IP1553_CMDR1_DATAWORDCOUNT_Pos))
#define IP1553_CMDR1_RTSUBADDRESS_Pos         _U_(5)                                               /**< (IP1553_CMDR1) RT SUBADDRESS Position */
#define IP1553_CMDR1_RTSUBADDRESS_Msk         (_U_(0x1F) << IP1553_CMDR1_RTSUBADDRESS_Pos)         /**< (IP1553_CMDR1) RT SUBADDRESS Mask */
#define IP1553_CMDR1_RTSUBADDRESS(value)      (IP1553_CMDR1_RTSUBADDRESS_Msk & ((value) << IP1553_CMDR1_RTSUBADDRESS_Pos))
#define IP1553_CMDR1_T_R_Pos                  _U_(10)                                              /**< (IP1553_CMDR1) T/R Position */
#define IP1553_CMDR1_T_R_Msk                  (_U_(0x1) << IP1553_CMDR1_T_R_Pos)                   /**< (IP1553_CMDR1) T/R Mask */
#define IP1553_CMDR1_T_R(value)               (IP1553_CMDR1_T_R_Msk & ((value) << IP1553_CMDR1_T_R_Pos))
#define IP1553_CMDR1_RTADDRESS_Pos            _U_(11)                                              /**< (IP1553_CMDR1) RT ADDRESS Position */
#define IP1553_CMDR1_RTADDRESS_Msk            (_U_(0x1F) << IP1553_CMDR1_RTADDRESS_Pos)            /**< (IP1553_CMDR1) RT ADDRESS Mask */
#define IP1553_CMDR1_RTADDRESS(value)         (IP1553_CMDR1_RTADDRESS_Msk & ((value) << IP1553_CMDR1_RTADDRESS_Pos))
#define IP1553_CMDR1_Msk                      _U_(0x0000FFFF)                                      /**< (IP1553_CMDR1) Register Mask  */


/* -------- IP1553_CMDR2 : (IP1553 Offset: 0x10) ( /W 32) Command Register 2 -------- */
#define IP1553_CMDR2_DATAWORDCOUNT_Pos        _U_(0)                                               /**< (IP1553_CMDR2) DATA WORD COUNT Position */
#define IP1553_CMDR2_DATAWORDCOUNT_Msk        (_U_(0x1F) << IP1553_CMDR2_DATAWORDCOUNT_Pos)        /**< (IP1553_CMDR2) DATA WORD COUNT Mask */
#define IP1553_CMDR2_DATAWORDCOUNT(value)     (IP1553_CMDR2_DATAWORDCOUNT_Msk & ((value) << IP1553_CMDR2_DATAWORDCOUNT_Pos))
#define IP1553_CMDR2_RTSUBADDRESS_Pos         _U_(5)                                               /**< (IP1553_CMDR2) RT SUBADDRESS Position */
#define IP1553_CMDR2_RTSUBADDRESS_Msk         (_U_(0x1F) << IP1553_CMDR2_RTSUBADDRESS_Pos)         /**< (IP1553_CMDR2) RT SUBADDRESS Mask */
#define IP1553_CMDR2_RTSUBADDRESS(value)      (IP1553_CMDR2_RTSUBADDRESS_Msk & ((value) << IP1553_CMDR2_RTSUBADDRESS_Pos))
#define IP1553_CMDR2_T_R_Pos                  _U_(10)                                              /**< (IP1553_CMDR2) R/T Position */
#define IP1553_CMDR2_T_R_Msk                  (_U_(0x1) << IP1553_CMDR2_T_R_Pos)                   /**< (IP1553_CMDR2) R/T Mask */
#define IP1553_CMDR2_T_R(value)               (IP1553_CMDR2_T_R_Msk & ((value) << IP1553_CMDR2_T_R_Pos))
#define IP1553_CMDR2_RTADDRESS_Pos            _U_(11)                                              /**< (IP1553_CMDR2) RT ADDRESS Position */
#define IP1553_CMDR2_RTADDRESS_Msk            (_U_(0x1F) << IP1553_CMDR2_RTADDRESS_Pos)            /**< (IP1553_CMDR2) RT ADDRESS Mask */
#define IP1553_CMDR2_RTADDRESS(value)         (IP1553_CMDR2_RTADDRESS_Msk & ((value) << IP1553_CMDR2_RTADDRESS_Pos))
#define IP1553_CMDR2_Msk                      _U_(0x0000FFFF)                                      /**< (IP1553_CMDR2) Register Mask  */


/* -------- IP1553_CMDR3 : (IP1553 Offset: 0x14) ( /W 32) Command Register 3 -------- */
#define IP1553_CMDR3_BUS_Pos                  _U_(0)                                               /**< (IP1553_CMDR3) bus used Position */
#define IP1553_CMDR3_BUS_Msk                  (_U_(0x1) << IP1553_CMDR3_BUS_Pos)                   /**< (IP1553_CMDR3) bus used Mask */
#define IP1553_CMDR3_BUS(value)               (IP1553_CMDR3_BUS_Msk & ((value) << IP1553_CMDR3_BUS_Pos))
#define IP1553_CMDR3_BCE_Pos                  _U_(1)                                               /**< (IP1553_CMDR3) 1553 emitter Position */
#define IP1553_CMDR3_BCE_Msk                  (_U_(0x1) << IP1553_CMDR3_BCE_Pos)                   /**< (IP1553_CMDR3) 1553 emitter Mask */
#define IP1553_CMDR3_BCE(value)               (IP1553_CMDR3_BCE_Msk & ((value) << IP1553_CMDR3_BCE_Pos))
#define IP1553_CMDR3_BCR_Pos                  _U_(2)                                               /**< (IP1553_CMDR3) 1553 receiver Position */
#define IP1553_CMDR3_BCR_Msk                  (_U_(0x1) << IP1553_CMDR3_BCR_Pos)                   /**< (IP1553_CMDR3) 1553 receiver Mask */
#define IP1553_CMDR3_BCR(value)               (IP1553_CMDR3_BCR_Msk & ((value) << IP1553_CMDR3_BCR_Pos))
#define IP1553_CMDR3_ER_Pos                   _U_(3)                                               /**< (IP1553_CMDR3) data or command transfer Position */
#define IP1553_CMDR3_ER_Msk                   (_U_(0x1) << IP1553_CMDR3_ER_Pos)                    /**< (IP1553_CMDR3) data or command transfer Mask */
#define IP1553_CMDR3_ER(value)                (IP1553_CMDR3_ER_Msk & ((value) << IP1553_CMDR3_ER_Pos))
#define IP1553_CMDR3_Msk                      _U_(0x0000000F)                                      /**< (IP1553_CMDR3) Register Mask  */


/* -------- IP1553_BITR : (IP1553 Offset: 0x18) ( /W 32) BIT Register -------- */
#define IP1553_BITR_TOBITWORD_Pos             _U_(0)                                               /**< (IP1553_BITR) to bit word Position */
#define IP1553_BITR_TOBITWORD_Msk             (_U_(0xFFFF) << IP1553_BITR_TOBITWORD_Pos)           /**< (IP1553_BITR) to bit word Mask */
#define IP1553_BITR_TOBITWORD(value)          (IP1553_BITR_TOBITWORD_Msk & ((value) << IP1553_BITR_TOBITWORD_Pos))
#define IP1553_BITR_Msk                       _U_(0x0000FFFF)                                      /**< (IP1553_BITR) Register Mask  */


/* -------- IP1553_VWR : (IP1553 Offset: 0x1C) ( /W 32) Vector Word Register -------- */
#define IP1553_VWR_TOVECTORWORD_Pos           _U_(0)                                               /**< (IP1553_VWR) to vector word Position */
#define IP1553_VWR_TOVECTORWORD_Msk           (_U_(0xFFFF) << IP1553_VWR_TOVECTORWORD_Pos)         /**< (IP1553_VWR) to vector word Mask */
#define IP1553_VWR_TOVECTORWORD(value)        (IP1553_VWR_TOVECTORWORD_Msk & ((value) << IP1553_VWR_TOVECTORWORD_Pos))
#define IP1553_VWR_Msk                        _U_(0x0000FFFF)                                      /**< (IP1553_VWR) Register Mask  */


/* -------- IP1553_IER : (IP1553 Offset: 0x20) ( /W 32) IRQ Mask Enable Register -------- */
#define IP1553_IER_EMT_Pos                    _U_(0)                                               /**< (IP1553_IER) EndMemTransfer Position */
#define IP1553_IER_EMT_Msk                    (_U_(0x1) << IP1553_IER_EMT_Pos)                     /**< (IP1553_IER) EndMemTransfer Mask */
#define IP1553_IER_EMT(value)                 (IP1553_IER_EMT_Msk & ((value) << IP1553_IER_EMT_Pos))
#define IP1553_IER_MTE_Pos                    _U_(1)                                               /**< (IP1553_IER) MemTransferErr Position */
#define IP1553_IER_MTE_Msk                    (_U_(0x1) << IP1553_IER_MTE_Pos)                     /**< (IP1553_IER) MemTransferErr Mask */
#define IP1553_IER_MTE(value)                 (IP1553_IER_MTE_Msk & ((value) << IP1553_IER_MTE_Pos))
#define IP1553_IER_ERX_Pos                    _U_(2)                                               /**< (IP1553_IER) End reception Position */
#define IP1553_IER_ERX_Msk                    (_U_(0x1) << IP1553_IER_ERX_Pos)                     /**< (IP1553_IER) End reception Mask */
#define IP1553_IER_ERX(value)                 (IP1553_IER_ERX_Msk & ((value) << IP1553_IER_ERX_Pos))
#define IP1553_IER_ETX_Pos                    _U_(3)                                               /**< (IP1553_IER) EndTransmission Position */
#define IP1553_IER_ETX_Msk                    (_U_(0x1) << IP1553_IER_ETX_Pos)                     /**< (IP1553_IER) EndTransmission Mask */
#define IP1553_IER_ETX(value)                 (IP1553_IER_ETX_Msk & ((value) << IP1553_IER_ETX_Pos))
#define IP1553_IER_ETRANS_Pos                 _U_(4)                                               /**< (IP1553_IER) EndTransfer Position */
#define IP1553_IER_ETRANS_Msk                 (_U_(0x3) << IP1553_IER_ETRANS_Pos)                  /**< (IP1553_IER) EndTransfer Mask */
#define IP1553_IER_ETRANS(value)              (IP1553_IER_ETRANS_Msk & ((value) << IP1553_IER_ETRANS_Pos))
#define IP1553_IER_TE_Pos                     _U_(6)                                               /**< (IP1553_IER) TransErr Position */
#define IP1553_IER_TE_Msk                     (_U_(0x1) << IP1553_IER_TE_Pos)                      /**< (IP1553_IER) TransErr Mask */
#define IP1553_IER_TE(value)                  (IP1553_IER_TE_Msk & ((value) << IP1553_IER_TE_Pos))
#define IP1553_IER_TCE_Pos                    _U_(7)                                               /**< (IP1553_IER) TransCodingErr Position */
#define IP1553_IER_TCE_Msk                    (_U_(0x1) << IP1553_IER_TCE_Pos)                     /**< (IP1553_IER) TransCodingErr Mask */
#define IP1553_IER_TCE(value)                 (IP1553_IER_TCE_Msk & ((value) << IP1553_IER_TCE_Pos))
#define IP1553_IER_TPE_Pos                    _U_(8)                                               /**< (IP1553_IER) TransParityErr Position */
#define IP1553_IER_TPE_Msk                    (_U_(0x1) << IP1553_IER_TPE_Pos)                     /**< (IP1553_IER) TransParityErr Mask */
#define IP1553_IER_TPE(value)                 (IP1553_IER_TPE_Msk & ((value) << IP1553_IER_TPE_Pos))
#define IP1553_IER_TDE_Pos                    _U_(9)                                               /**< (IP1553_IER) TransDataTypeErr Position */
#define IP1553_IER_TDE_Msk                    (_U_(0x1) << IP1553_IER_TDE_Pos)                     /**< (IP1553_IER) TransDataTypeErr Mask */
#define IP1553_IER_TDE(value)                 (IP1553_IER_TDE_Msk & ((value) << IP1553_IER_TDE_Pos))
#define IP1553_IER_TTE_Pos                    _U_(10)                                              /**< (IP1553_IER) TransTimeOutErr Position */
#define IP1553_IER_TTE_Msk                    (_U_(0x1) << IP1553_IER_TTE_Pos)                     /**< (IP1553_IER) TransTimeOutErr Mask */
#define IP1553_IER_TTE(value)                 (IP1553_IER_TTE_Msk & ((value) << IP1553_IER_TTE_Pos))
#define IP1553_IER_TWE_Pos                    _U_(11)                                              /**< (IP1553_IER) TransWordCounterErr Position */
#define IP1553_IER_TWE_Msk                    (_U_(0x1) << IP1553_IER_TWE_Pos)                     /**< (IP1553_IER) TransWordCounterErr Mask */
#define IP1553_IER_TWE(value)                 (IP1553_IER_TWE_Msk & ((value) << IP1553_IER_TWE_Pos))
#define IP1553_IER_BE_Pos                     _U_(12)                                              /**< (IP1553_IER) BufIFErr Position */
#define IP1553_IER_BE_Msk                     (_U_(0x1) << IP1553_IER_BE_Pos)                      /**< (IP1553_IER) BufIFErr Mask */
#define IP1553_IER_BE(value)                  (IP1553_IER_BE_Msk & ((value) << IP1553_IER_BE_Pos))
#define IP1553_IER_ITR_Pos                    _U_(13)                                              /**< (IP1553_IER) IllegalTransferReq Position */
#define IP1553_IER_ITR_Msk                    (_U_(0x1) << IP1553_IER_ITR_Pos)                     /**< (IP1553_IER) IllegalTransferReq Mask */
#define IP1553_IER_ITR(value)                 (IP1553_IER_ITR_Msk & ((value) << IP1553_IER_ITR_Pos))
#define IP1553_IER_TVR_Pos                    _U_(14)                                              /**< (IP1553_IER) TransVecWordReq Position */
#define IP1553_IER_TVR_Msk                    (_U_(0x1) << IP1553_IER_TVR_Pos)                     /**< (IP1553_IER) TransVecWordReq Mask */
#define IP1553_IER_TVR(value)                 (IP1553_IER_TVR_Msk & ((value) << IP1553_IER_TVR_Pos))
#define IP1553_IER_DBR_Pos                    _U_(15)                                              /**< (IP1553_IER) DynamicBusContReq Position */
#define IP1553_IER_DBR_Msk                    (_U_(0x1) << IP1553_IER_DBR_Pos)                     /**< (IP1553_IER) DynamicBusContReq Mask */
#define IP1553_IER_DBR(value)                 (IP1553_IER_DBR_Msk & ((value) << IP1553_IER_DBR_Pos))
#define IP1553_IER_STR_Pos                    _U_(16)                                              /**< (IP1553_IER) InitSelfTestReq Position */
#define IP1553_IER_STR_Msk                    (_U_(0x1) << IP1553_IER_STR_Pos)                     /**< (IP1553_IER) InitSelfTestReq Mask */
#define IP1553_IER_STR(value)                 (IP1553_IER_STR_Msk & ((value) << IP1553_IER_STR_Pos))
#define IP1553_IER_TSR_Pos                    _U_(17)                                              /**< (IP1553_IER) TranShutdownReq Position */
#define IP1553_IER_TSR_Msk                    (_U_(0x1) << IP1553_IER_TSR_Pos)                     /**< (IP1553_IER) TranShutdownReq Mask */
#define IP1553_IER_TSR(value)                 (IP1553_IER_TSR_Msk & ((value) << IP1553_IER_TSR_Pos))
#define IP1553_IER_OSR_Pos                    _U_(18)                                              /**< (IP1553_IER) OvTranShutdownReq Position */
#define IP1553_IER_OSR_Msk                    (_U_(0x1) << IP1553_IER_OSR_Pos)                     /**< (IP1553_IER) OvTranShutdownReq Mask */
#define IP1553_IER_OSR(value)                 (IP1553_IER_OSR_Msk & ((value) << IP1553_IER_OSR_Pos))
#define IP1553_IER_SDR_Pos                    _U_(19)                                              /**< (IP1553_IER) SyncWithDataReq Position */
#define IP1553_IER_SDR_Msk                    (_U_(0x1) << IP1553_IER_SDR_Pos)                     /**< (IP1553_IER) SyncWithDataReq Mask */
#define IP1553_IER_SDR(value)                 (IP1553_IER_SDR_Msk & ((value) << IP1553_IER_SDR_Pos))
#define IP1553_IER_SWD_Pos                    _U_(20)                                              /**< (IP1553_IER) SyncWithoutDataReq Position */
#define IP1553_IER_SWD_Msk                    (_U_(0x1) << IP1553_IER_SWD_Pos)                     /**< (IP1553_IER) SyncWithoutDataReq Mask */
#define IP1553_IER_SWD(value)                 (IP1553_IER_SWD_Msk & ((value) << IP1553_IER_SWD_Pos))
#define IP1553_IER_RRT_Pos                    _U_(21)                                              /**< (IP1553_IER) ResetRTReq Position */
#define IP1553_IER_RRT_Msk                    (_U_(0x1) << IP1553_IER_RRT_Pos)                     /**< (IP1553_IER) ResetRTReq Mask */
#define IP1553_IER_RRT(value)                 (IP1553_IER_RRT_Msk & ((value) << IP1553_IER_RRT_Pos))
#define IP1553_IER_ITF_Pos                    _U_(22)                                              /**< (IP1553_IER) InhibitTermFlagReq Position */
#define IP1553_IER_ITF_Msk                    (_U_(0x1) << IP1553_IER_ITF_Pos)                     /**< (IP1553_IER) InhibitTermFlagReq Mask */
#define IP1553_IER_ITF(value)                 (IP1553_IER_ITF_Msk & ((value) << IP1553_IER_ITF_Pos))
#define IP1553_IER_OTF_Pos                    _U_(23)                                              /**< (IP1553_IER) OvInhibitTermFlagReq Position */
#define IP1553_IER_OTF_Msk                    (_U_(0x1) << IP1553_IER_OTF_Pos)                     /**< (IP1553_IER) OvInhibitTermFlagReq Mask */
#define IP1553_IER_OTF(value)                 (IP1553_IER_OTF_Msk & ((value) << IP1553_IER_OTF_Pos))
#define IP1553_IER_IPB_Pos                    _U_(24)                                              /**< (IP1553_IER) IPBusy Position */
#define IP1553_IER_IPB_Msk                    (_U_(0x1) << IP1553_IER_IPB_Pos)                     /**< (IP1553_IER) IPBusy Mask */
#define IP1553_IER_IPB(value)                 (IP1553_IER_IPB_Msk & ((value) << IP1553_IER_IPB_Pos))
#define IP1553_IER_Msk                        _U_(0x01FFFFFF)                                      /**< (IP1553_IER) Register Mask  */


