Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/ip1553.h
/* -------- IP1553_IDR : (IP1553 Offset: 0x24) ( /W 32) IRQ Mask Disable Register -------- */
#define IP1553_IDR_EMT_Pos                    _U_(0)                                               /**< (IP1553_IDR) EndMemTransfer Position */
#define IP1553_IDR_EMT_Msk                    (_U_(0x1) << IP1553_IDR_EMT_Pos)                     /**< (IP1553_IDR) EndMemTransfer Mask */
#define IP1553_IDR_EMT(value)                 (IP1553_IDR_EMT_Msk & ((value) << IP1553_IDR_EMT_Pos))
#define IP1553_IDR_MTE_Pos                    _U_(1)                                               /**< (IP1553_IDR) MemTransferErr Position */
#define IP1553_IDR_MTE_Msk                    (_U_(0x1) << IP1553_IDR_MTE_Pos)                     /**< (IP1553_IDR) MemTransferErr Mask */
#define IP1553_IDR_MTE(value)                 (IP1553_IDR_MTE_Msk & ((value) << IP1553_IDR_MTE_Pos))
#define IP1553_IDR_ERX_Pos                    _U_(2)                                               /**< (IP1553_IDR) End reception Position */
#define IP1553_IDR_ERX_Msk                    (_U_(0x1) << IP1553_IDR_ERX_Pos)                     /**< (IP1553_IDR) End reception Mask */
#define IP1553_IDR_ERX(value)                 (IP1553_IDR_ERX_Msk & ((value) << IP1553_IDR_ERX_Pos))
#define IP1553_IDR_ETX_Pos                    _U_(3)                                               /**< (IP1553_IDR) EndTransmission Position */
#define IP1553_IDR_ETX_Msk                    (_U_(0x1) << IP1553_IDR_ETX_Pos)                     /**< (IP1553_IDR) EndTransmission Mask */
#define IP1553_IDR_ETX(value)                 (IP1553_IDR_ETX_Msk & ((value) << IP1553_IDR_ETX_Pos))
#define IP1553_IDR_ETRANS_Pos                 _U_(4)                                               /**< (IP1553_IDR) EndTransfer Position */
#define IP1553_IDR_ETRANS_Msk                 (_U_(0x3) << IP1553_IDR_ETRANS_Pos)                  /**< (IP1553_IDR) EndTransfer Mask */
#define IP1553_IDR_ETRANS(value)              (IP1553_IDR_ETRANS_Msk & ((value) << IP1553_IDR_ETRANS_Pos))
#define IP1553_IDR_TE_Pos                     _U_(6)                                               /**< (IP1553_IDR) TransErr Position */
#define IP1553_IDR_TE_Msk                     (_U_(0x1) << IP1553_IDR_TE_Pos)                      /**< (IP1553_IDR) TransErr Mask */
#define IP1553_IDR_TE(value)                  (IP1553_IDR_TE_Msk & ((value) << IP1553_IDR_TE_Pos))
#define IP1553_IDR_TCE_Pos                    _U_(7)                                               /**< (IP1553_IDR) TransCodingErr Position */
#define IP1553_IDR_TCE_Msk                    (_U_(0x1) << IP1553_IDR_TCE_Pos)                     /**< (IP1553_IDR) TransCodingErr Mask */
#define IP1553_IDR_TCE(value)                 (IP1553_IDR_TCE_Msk & ((value) << IP1553_IDR_TCE_Pos))
#define IP1553_IDR_TPE_Pos                    _U_(8)                                               /**< (IP1553_IDR) TransParityErr Position */
#define IP1553_IDR_TPE_Msk                    (_U_(0x1) << IP1553_IDR_TPE_Pos)                     /**< (IP1553_IDR) TransParityErr Mask */
#define IP1553_IDR_TPE(value)                 (IP1553_IDR_TPE_Msk & ((value) << IP1553_IDR_TPE_Pos))
#define IP1553_IDR_TDE_Pos                    _U_(9)                                               /**< (IP1553_IDR) TransDataTypeErr Position */
#define IP1553_IDR_TDE_Msk                    (_U_(0x1) << IP1553_IDR_TDE_Pos)                     /**< (IP1553_IDR) TransDataTypeErr Mask */
#define IP1553_IDR_TDE(value)                 (IP1553_IDR_TDE_Msk & ((value) << IP1553_IDR_TDE_Pos))
#define IP1553_IDR_TTE_Pos                    _U_(10)                                              /**< (IP1553_IDR) TransTimeOutErr Position */
#define IP1553_IDR_TTE_Msk                    (_U_(0x1) << IP1553_IDR_TTE_Pos)                     /**< (IP1553_IDR) TransTimeOutErr Mask */
#define IP1553_IDR_TTE(value)                 (IP1553_IDR_TTE_Msk & ((value) << IP1553_IDR_TTE_Pos))
#define IP1553_IDR_TWE_Pos                    _U_(11)                                              /**< (IP1553_IDR) TransWordCounterErr Position */
#define IP1553_IDR_TWE_Msk                    (_U_(0x1) << IP1553_IDR_TWE_Pos)                     /**< (IP1553_IDR) TransWordCounterErr Mask */
#define IP1553_IDR_TWE(value)                 (IP1553_IDR_TWE_Msk & ((value) << IP1553_IDR_TWE_Pos))
#define IP1553_IDR_BE_Pos                     _U_(12)                                              /**< (IP1553_IDR) BufIFErr Position */
#define IP1553_IDR_BE_Msk                     (_U_(0x1) << IP1553_IDR_BE_Pos)                      /**< (IP1553_IDR) BufIFErr Mask */
#define IP1553_IDR_BE(value)                  (IP1553_IDR_BE_Msk & ((value) << IP1553_IDR_BE_Pos))
#define IP1553_IDR_ITR_Pos                    _U_(13)                                              /**< (IP1553_IDR) IllegalTransferReq Position */
#define IP1553_IDR_ITR_Msk                    (_U_(0x1) << IP1553_IDR_ITR_Pos)                     /**< (IP1553_IDR) IllegalTransferReq Mask */
#define IP1553_IDR_ITR(value)                 (IP1553_IDR_ITR_Msk & ((value) << IP1553_IDR_ITR_Pos))
#define IP1553_IDR_TVR_Pos                    _U_(14)                                              /**< (IP1553_IDR) TransVecWordReq Position */
#define IP1553_IDR_TVR_Msk                    (_U_(0x1) << IP1553_IDR_TVR_Pos)                     /**< (IP1553_IDR) TransVecWordReq Mask */
#define IP1553_IDR_TVR(value)                 (IP1553_IDR_TVR_Msk & ((value) << IP1553_IDR_TVR_Pos))
#define IP1553_IDR_DBR_Pos                    _U_(15)                                              /**< (IP1553_IDR) DynamicBusContReq Position */
#define IP1553_IDR_DBR_Msk                    (_U_(0x1) << IP1553_IDR_DBR_Pos)                     /**< (IP1553_IDR) DynamicBusContReq Mask */
#define IP1553_IDR_DBR(value)                 (IP1553_IDR_DBR_Msk & ((value) << IP1553_IDR_DBR_Pos))
#define IP1553_IDR_STR_Pos                    _U_(16)                                              /**< (IP1553_IDR) InitSelfTestReq Position */
#define IP1553_IDR_STR_Msk                    (_U_(0x1) << IP1553_IDR_STR_Pos)                     /**< (IP1553_IDR) InitSelfTestReq Mask */
#define IP1553_IDR_STR(value)                 (IP1553_IDR_STR_Msk & ((value) << IP1553_IDR_STR_Pos))
#define IP1553_IDR_TSR_Pos                    _U_(17)                                              /**< (IP1553_IDR) TranShutdownReq Position */
#define IP1553_IDR_TSR_Msk                    (_U_(0x1) << IP1553_IDR_TSR_Pos)                     /**< (IP1553_IDR) TranShutdownReq Mask */
#define IP1553_IDR_TSR(value)                 (IP1553_IDR_TSR_Msk & ((value) << IP1553_IDR_TSR_Pos))
#define IP1553_IDR_OSR_Pos                    _U_(18)                                              /**< (IP1553_IDR) OvTranShutdownReq Position */
#define IP1553_IDR_OSR_Msk                    (_U_(0x1) << IP1553_IDR_OSR_Pos)                     /**< (IP1553_IDR) OvTranShutdownReq Mask */
#define IP1553_IDR_OSR(value)                 (IP1553_IDR_OSR_Msk & ((value) << IP1553_IDR_OSR_Pos))
#define IP1553_IDR_SDR_Pos                    _U_(19)                                              /**< (IP1553_IDR) SyncWithDataReq Position */
#define IP1553_IDR_SDR_Msk                    (_U_(0x1) << IP1553_IDR_SDR_Pos)                     /**< (IP1553_IDR) SyncWithDataReq Mask */
#define IP1553_IDR_SDR(value)                 (IP1553_IDR_SDR_Msk & ((value) << IP1553_IDR_SDR_Pos))
#define IP1553_IDR_SWD_Pos                    _U_(20)                                              /**< (IP1553_IDR) SyncWithoutDataReq Position */
#define IP1553_IDR_SWD_Msk                    (_U_(0x1) << IP1553_IDR_SWD_Pos)                     /**< (IP1553_IDR) SyncWithoutDataReq Mask */
#define IP1553_IDR_SWD(value)                 (IP1553_IDR_SWD_Msk & ((value) << IP1553_IDR_SWD_Pos))
#define IP1553_IDR_RRT_Pos                    _U_(21)                                              /**< (IP1553_IDR) ResetRTReq Position */
#define IP1553_IDR_RRT_Msk                    (_U_(0x1) << IP1553_IDR_RRT_Pos)                     /**< (IP1553_IDR) ResetRTReq Mask */
#define IP1553_IDR_RRT(value)                 (IP1553_IDR_RRT_Msk & ((value) << IP1553_IDR_RRT_Pos))
#define IP1553_IDR_ITF_Pos                    _U_(22)                                              /**< (IP1553_IDR) InhibitTermFlagReq Position */
#define IP1553_IDR_ITF_Msk                    (_U_(0x1) << IP1553_IDR_ITF_Pos)                     /**< (IP1553_IDR) InhibitTermFlagReq Mask */
#define IP1553_IDR_ITF(value)                 (IP1553_IDR_ITF_Msk & ((value) << IP1553_IDR_ITF_Pos))
#define IP1553_IDR_OTF_Pos                    _U_(23)                                              /**< (IP1553_IDR) OvInhibitTermFlagReq Position */
#define IP1553_IDR_OTF_Msk                    (_U_(0x1) << IP1553_IDR_OTF_Pos)                     /**< (IP1553_IDR) OvInhibitTermFlagReq Mask */
#define IP1553_IDR_OTF(value)                 (IP1553_IDR_OTF_Msk & ((value) << IP1553_IDR_OTF_Pos))
#define IP1553_IDR_IPB_Pos                    _U_(24)                                              /**< (IP1553_IDR) IPBusy Position */
#define IP1553_IDR_IPB_Msk                    (_U_(0x1) << IP1553_IDR_IPB_Pos)                     /**< (IP1553_IDR) IPBusy Mask */
#define IP1553_IDR_IPB(value)                 (IP1553_IDR_IPB_Msk & ((value) << IP1553_IDR_IPB_Pos))
#define IP1553_IDR_Msk                        _U_(0x01FFFFFF)                                      /**< (IP1553_IDR) Register Mask  */


/* -------- IP1553_IMR : (IP1553 Offset: 0x28) ( R/ 32) IRQ Mask Register -------- */
#define IP1553_IMR_EMT_Pos                    _U_(0)                                               /**< (IP1553_IMR) EndMemTransfer Position */
#define IP1553_IMR_EMT_Msk                    (_U_(0x1) << IP1553_IMR_EMT_Pos)                     /**< (IP1553_IMR) EndMemTransfer Mask */
#define IP1553_IMR_EMT(value)                 (IP1553_IMR_EMT_Msk & ((value) << IP1553_IMR_EMT_Pos))
#define IP1553_IMR_MTE_Pos                    _U_(1)                                               /**< (IP1553_IMR) MemTransferErr Position */
#define IP1553_IMR_MTE_Msk                    (_U_(0x1) << IP1553_IMR_MTE_Pos)                     /**< (IP1553_IMR) MemTransferErr Mask */
#define IP1553_IMR_MTE(value)                 (IP1553_IMR_MTE_Msk & ((value) << IP1553_IMR_MTE_Pos))
#define IP1553_IMR_ERX_Pos                    _U_(2)                                               /**< (IP1553_IMR) End reception Position */
#define IP1553_IMR_ERX_Msk                    (_U_(0x1) << IP1553_IMR_ERX_Pos)                     /**< (IP1553_IMR) End reception Mask */
#define IP1553_IMR_ERX(value)                 (IP1553_IMR_ERX_Msk & ((value) << IP1553_IMR_ERX_Pos))
#define IP1553_IMR_ETX_Pos                    _U_(3)                                               /**< (IP1553_IMR) EndTransmission Position */
#define IP1553_IMR_ETX_Msk                    (_U_(0x1) << IP1553_IMR_ETX_Pos)                     /**< (IP1553_IMR) EndTransmission Mask */
#define IP1553_IMR_ETX(value)                 (IP1553_IMR_ETX_Msk & ((value) << IP1553_IMR_ETX_Pos))
#define IP1553_IMR_ETRANS_Pos                 _U_(4)                                               /**< (IP1553_IMR) EndTransfer Position */
#define IP1553_IMR_ETRANS_Msk                 (_U_(0x3) << IP1553_IMR_ETRANS_Pos)                  /**< (IP1553_IMR) EndTransfer Mask */
#define IP1553_IMR_ETRANS(value)              (IP1553_IMR_ETRANS_Msk & ((value) << IP1553_IMR_ETRANS_Pos))
#define IP1553_IMR_TE_Pos                     _U_(6)                                               /**< (IP1553_IMR) TransErr Position */
#define IP1553_IMR_TE_Msk                     (_U_(0x1) << IP1553_IMR_TE_Pos)                      /**< (IP1553_IMR) TransErr Mask */
#define IP1553_IMR_TE(value)                  (IP1553_IMR_TE_Msk & ((value) << IP1553_IMR_TE_Pos))
#define IP1553_IMR_TCE_Pos                    _U_(7)                                               /**< (IP1553_IMR) TransCodingErr Position */
#define IP1553_IMR_TCE_Msk                    (_U_(0x1) << IP1553_IMR_TCE_Pos)                     /**< (IP1553_IMR) TransCodingErr Mask */
#define IP1553_IMR_TCE(value)                 (IP1553_IMR_TCE_Msk & ((value) << IP1553_IMR_TCE_Pos))
#define IP1553_IMR_TPE_Pos                    _U_(8)                                               /**< (IP1553_IMR) TransParityErr Position */
#define IP1553_IMR_TPE_Msk                    (_U_(0x1) << IP1553_IMR_TPE_Pos)                     /**< (IP1553_IMR) TransParityErr Mask */
#define IP1553_IMR_TPE(value)                 (IP1553_IMR_TPE_Msk & ((value) << IP1553_IMR_TPE_Pos))
#define IP1553_IMR_TDE_Pos                    _U_(9)                                               /**< (IP1553_IMR) TransDataTypeErr Position */
#define IP1553_IMR_TDE_Msk                    (_U_(0x1) << IP1553_IMR_TDE_Pos)                     /**< (IP1553_IMR) TransDataTypeErr Mask */
#define IP1553_IMR_TDE(value)                 (IP1553_IMR_TDE_Msk & ((value) << IP1553_IMR_TDE_Pos))
#define IP1553_IMR_TTE_Pos                    _U_(10)                                              /**< (IP1553_IMR) TransTimeOutErr Position */
#define IP1553_IMR_TTE_Msk                    (_U_(0x1) << IP1553_IMR_TTE_Pos)                     /**< (IP1553_IMR) TransTimeOutErr Mask */
#define IP1553_IMR_TTE(value)                 (IP1553_IMR_TTE_Msk & ((value) << IP1553_IMR_TTE_Pos))
#define IP1553_IMR_TWE_Pos                    _U_(11)                                              /**< (IP1553_IMR) TransWordCounterErr Position */
#define IP1553_IMR_TWE_Msk                    (_U_(0x1) << IP1553_IMR_TWE_Pos)                     /**< (IP1553_IMR) TransWordCounterErr Mask */
#define IP1553_IMR_TWE(value)                 (IP1553_IMR_TWE_Msk & ((value) << IP1553_IMR_TWE_Pos))
#define IP1553_IMR_BE_Pos                     _U_(12)                                              /**< (IP1553_IMR) BufIFErr Position */
#define IP1553_IMR_BE_Msk                     (_U_(0x1) << IP1553_IMR_BE_Pos)                      /**< (IP1553_IMR) BufIFErr Mask */
#define IP1553_IMR_BE(value)                  (IP1553_IMR_BE_Msk & ((value) << IP1553_IMR_BE_Pos))
#define IP1553_IMR_ITR_Pos                    _U_(13)                                              /**< (IP1553_IMR) IllegalTransferReq Position */
#define IP1553_IMR_ITR_Msk                    (_U_(0x1) << IP1553_IMR_ITR_Pos)                     /**< (IP1553_IMR) IllegalTransferReq Mask */
#define IP1553_IMR_ITR(value)                 (IP1553_IMR_ITR_Msk & ((value) << IP1553_IMR_ITR_Pos))
#define IP1553_IMR_TVR_Pos                    _U_(14)                                              /**< (IP1553_IMR) TransVecWordReq Position */
#define IP1553_IMR_TVR_Msk                    (_U_(0x1) << IP1553_IMR_TVR_Pos)                     /**< (IP1553_IMR) TransVecWordReq Mask */
#define IP1553_IMR_TVR(value)                 (IP1553_IMR_TVR_Msk & ((value) << IP1553_IMR_TVR_Pos))
#define IP1553_IMR_DBR_Pos                    _U_(15)                                              /**< (IP1553_IMR) DynamicBusContReq Position */
#define IP1553_IMR_DBR_Msk                    (_U_(0x1) << IP1553_IMR_DBR_Pos)                     /**< (IP1553_IMR) DynamicBusContReq Mask */
#define IP1553_IMR_DBR(value)                 (IP1553_IMR_DBR_Msk & ((value) << IP1553_IMR_DBR_Pos))
#define IP1553_IMR_STR_Pos                    _U_(16)                                              /**< (IP1553_IMR) InitSelfTestReq Position */
#define IP1553_IMR_STR_Msk                    (_U_(0x1) << IP1553_IMR_STR_Pos)                     /**< (IP1553_IMR) InitSelfTestReq Mask */
#define IP1553_IMR_STR(value)                 (IP1553_IMR_STR_Msk & ((value) << IP1553_IMR_STR_Pos))
#define IP1553_IMR_TSR_Pos                    _U_(17)                                              /**< (IP1553_IMR) TranShutdownReq Position */
#define IP1553_IMR_TSR_Msk                    (_U_(0x1) << IP1553_IMR_TSR_Pos)                     /**< (IP1553_IMR) TranShutdownReq Mask */
#define IP1553_IMR_TSR(value)                 (IP1553_IMR_TSR_Msk & ((value) << IP1553_IMR_TSR_Pos))
#define IP1553_IMR_OSR_Pos                    _U_(18)                                              /**< (IP1553_IMR) OvTranShutdownReq Position */
#define IP1553_IMR_OSR_Msk                    (_U_(0x1) << IP1553_IMR_OSR_Pos)                     /**< (IP1553_IMR) OvTranShutdownReq Mask */
#define IP1553_IMR_OSR(value)                 (IP1553_IMR_OSR_Msk & ((value) << IP1553_IMR_OSR_Pos))
#define IP1553_IMR_SDR_Pos                    _U_(19)                                              /**< (IP1553_IMR) SyncWithDataReq Position */
#define IP1553_IMR_SDR_Msk                    (_U_(0x1) << IP1553_IMR_SDR_Pos)                     /**< (IP1553_IMR) SyncWithDataReq Mask */
#define IP1553_IMR_SDR(value)                 (IP1553_IMR_SDR_Msk & ((value) << IP1553_IMR_SDR_Pos))
#define IP1553_IMR_SWD_Pos                    _U_(20)                                              /**< (IP1553_IMR) SyncWithoutDataReq Position */
#define IP1553_IMR_SWD_Msk                    (_U_(0x1) << IP1553_IMR_SWD_Pos)                     /**< (IP1553_IMR) SyncWithoutDataReq Mask */
#define IP1553_IMR_SWD(value)                 (IP1553_IMR_SWD_Msk & ((value) << IP1553_IMR_SWD_Pos))
#define IP1553_IMR_RRT_Pos                    _U_(21)                                              /**< (IP1553_IMR) ResetRTReq Position */
#define IP1553_IMR_RRT_Msk                    (_U_(0x1) << IP1553_IMR_RRT_Pos)                     /**< (IP1553_IMR) ResetRTReq Mask */
#define IP1553_IMR_RRT(value)                 (IP1553_IMR_RRT_Msk & ((value) << IP1553_IMR_RRT_Pos))
#define IP1553_IMR_ITF_Pos                    _U_(22)                                              /**< (IP1553_IMR) InhibitTermFlagReq Position */
#define IP1553_IMR_ITF_Msk                    (_U_(0x1) << IP1553_IMR_ITF_Pos)                     /**< (IP1553_IMR) InhibitTermFlagReq Mask */
#define IP1553_IMR_ITF(value)                 (IP1553_IMR_ITF_Msk & ((value) << IP1553_IMR_ITF_Pos))
#define IP1553_IMR_OTF_Pos                    _U_(23)                                              /**< (IP1553_IMR) OvInhibitTermFlagReq Position */
#define IP1553_IMR_OTF_Msk                    (_U_(0x1) << IP1553_IMR_OTF_Pos)                     /**< (IP1553_IMR) OvInhibitTermFlagReq Mask */
#define IP1553_IMR_OTF(value)                 (IP1553_IMR_OTF_Msk & ((value) << IP1553_IMR_OTF_Pos))
#define IP1553_IMR_IPB_Pos                    _U_(24)                                              /**< (IP1553_IMR) IPBusy Position */
#define IP1553_IMR_IPB_Msk                    (_U_(0x1) << IP1553_IMR_IPB_Pos)                     /**< (IP1553_IMR) IPBusy Mask */
#define IP1553_IMR_IPB(value)                 (IP1553_IMR_IPB_Msk & ((value) << IP1553_IMR_IPB_Pos))
#define IP1553_IMR_Msk                        _U_(0x01FFFFFF)                                      /**< (IP1553_IMR) Register Mask  */


