Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/ip1553.h
/* -------- IP1553_ISR : (IP1553 Offset: 0x2C) ( R/ 32) IRQ Status Register -------- */
#define IP1553_ISR_EMT_Pos                    _U_(0)                                               /**< (IP1553_ISR) EndMemTransfer Position */
#define IP1553_ISR_EMT_Msk                    (_U_(0x1) << IP1553_ISR_EMT_Pos)                     /**< (IP1553_ISR) EndMemTransfer Mask */
#define IP1553_ISR_EMT(value)                 (IP1553_ISR_EMT_Msk & ((value) << IP1553_ISR_EMT_Pos))
#define IP1553_ISR_MTE_Pos                    _U_(1)                                               /**< (IP1553_ISR) MemTransferErr Position */
#define IP1553_ISR_MTE_Msk                    (_U_(0x1) << IP1553_ISR_MTE_Pos)                     /**< (IP1553_ISR) MemTransferErr Mask */
#define IP1553_ISR_MTE(value)                 (IP1553_ISR_MTE_Msk & ((value) << IP1553_ISR_MTE_Pos))
#define IP1553_ISR_ERX_Pos                    _U_(2)                                               /**< (IP1553_ISR) End reception Position */
#define IP1553_ISR_ERX_Msk                    (_U_(0x1) << IP1553_ISR_ERX_Pos)                     /**< (IP1553_ISR) End reception Mask */
#define IP1553_ISR_ERX(value)                 (IP1553_ISR_ERX_Msk & ((value) << IP1553_ISR_ERX_Pos))
#define IP1553_ISR_ETX_Pos                    _U_(3)                                               /**< (IP1553_ISR) EndTransmission Position */
#define IP1553_ISR_ETX_Msk                    (_U_(0x1) << IP1553_ISR_ETX_Pos)                     /**< (IP1553_ISR) EndTransmission Mask */
#define IP1553_ISR_ETX(value)                 (IP1553_ISR_ETX_Msk & ((value) << IP1553_ISR_ETX_Pos))
#define IP1553_ISR_ETRANS_Pos                 _U_(4)                                               /**< (IP1553_ISR) EndTransfer Position */
#define IP1553_ISR_ETRANS_Msk                 (_U_(0x3) << IP1553_ISR_ETRANS_Pos)                  /**< (IP1553_ISR) EndTransfer Mask */
#define IP1553_ISR_ETRANS(value)              (IP1553_ISR_ETRANS_Msk & ((value) << IP1553_ISR_ETRANS_Pos))
#define IP1553_ISR_TE_Pos                     _U_(6)                                               /**< (IP1553_ISR) TransErr Position */
#define IP1553_ISR_TE_Msk                     (_U_(0x1) << IP1553_ISR_TE_Pos)                      /**< (IP1553_ISR) TransErr Mask */
#define IP1553_ISR_TE(value)                  (IP1553_ISR_TE_Msk & ((value) << IP1553_ISR_TE_Pos))
#define IP1553_ISR_TCE_Pos                    _U_(7)                                               /**< (IP1553_ISR) TransCodingErr Position */
#define IP1553_ISR_TCE_Msk                    (_U_(0x1) << IP1553_ISR_TCE_Pos)                     /**< (IP1553_ISR) TransCodingErr Mask */
#define IP1553_ISR_TCE(value)                 (IP1553_ISR_TCE_Msk & ((value) << IP1553_ISR_TCE_Pos))
#define IP1553_ISR_TPE_Pos                    _U_(8)                                               /**< (IP1553_ISR) TransParityErr Position */
#define IP1553_ISR_TPE_Msk                    (_U_(0x1) << IP1553_ISR_TPE_Pos)                     /**< (IP1553_ISR) TransParityErr Mask */
#define IP1553_ISR_TPE(value)                 (IP1553_ISR_TPE_Msk & ((value) << IP1553_ISR_TPE_Pos))
#define IP1553_ISR_TDE_Pos                    _U_(9)                                               /**< (IP1553_ISR) TransDataTypeErr Position */
#define IP1553_ISR_TDE_Msk                    (_U_(0x1) << IP1553_ISR_TDE_Pos)                     /**< (IP1553_ISR) TransDataTypeErr Mask */
#define IP1553_ISR_TDE(value)                 (IP1553_ISR_TDE_Msk & ((value) << IP1553_ISR_TDE_Pos))
#define IP1553_ISR_TTE_Pos                    _U_(10)                                              /**< (IP1553_ISR) TransTimeOutErr Position */
#define IP1553_ISR_TTE_Msk                    (_U_(0x1) << IP1553_ISR_TTE_Pos)                     /**< (IP1553_ISR) TransTimeOutErr Mask */
#define IP1553_ISR_TTE(value)                 (IP1553_ISR_TTE_Msk & ((value) << IP1553_ISR_TTE_Pos))
#define IP1553_ISR_TWE_Pos                    _U_(11)                                              /**< (IP1553_ISR) TransWordCounterErr Position */
#define IP1553_ISR_TWE_Msk                    (_U_(0x1) << IP1553_ISR_TWE_Pos)                     /**< (IP1553_ISR) TransWordCounterErr Mask */
#define IP1553_ISR_TWE(value)                 (IP1553_ISR_TWE_Msk & ((value) << IP1553_ISR_TWE_Pos))
#define IP1553_ISR_BE_Pos                     _U_(12)                                              /**< (IP1553_ISR) BufIFErr Position */
#define IP1553_ISR_BE_Msk                     (_U_(0x1) << IP1553_ISR_BE_Pos)                      /**< (IP1553_ISR) BufIFErr Mask */
#define IP1553_ISR_BE(value)                  (IP1553_ISR_BE_Msk & ((value) << IP1553_ISR_BE_Pos))
#define IP1553_ISR_ITR_Pos                    _U_(13)                                              /**< (IP1553_ISR) IllegalTransferReq Position */
#define IP1553_ISR_ITR_Msk                    (_U_(0x1) << IP1553_ISR_ITR_Pos)                     /**< (IP1553_ISR) IllegalTransferReq Mask */
#define IP1553_ISR_ITR(value)                 (IP1553_ISR_ITR_Msk & ((value) << IP1553_ISR_ITR_Pos))
#define IP1553_ISR_TVR_Pos                    _U_(14)                                              /**< (IP1553_ISR) TransVecWordReq Position */
#define IP1553_ISR_TVR_Msk                    (_U_(0x1) << IP1553_ISR_TVR_Pos)                     /**< (IP1553_ISR) TransVecWordReq Mask */
#define IP1553_ISR_TVR(value)                 (IP1553_ISR_TVR_Msk & ((value) << IP1553_ISR_TVR_Pos))
#define IP1553_ISR_DBR_Pos                    _U_(15)                                              /**< (IP1553_ISR) DynamicBusContReq Position */
#define IP1553_ISR_DBR_Msk                    (_U_(0x1) << IP1553_ISR_DBR_Pos)                     /**< (IP1553_ISR) DynamicBusContReq Mask */
#define IP1553_ISR_DBR(value)                 (IP1553_ISR_DBR_Msk & ((value) << IP1553_ISR_DBR_Pos))
#define IP1553_ISR_STR_Pos                    _U_(16)                                              /**< (IP1553_ISR) InitSelfTestReq Position */
#define IP1553_ISR_STR_Msk                    (_U_(0x1) << IP1553_ISR_STR_Pos)                     /**< (IP1553_ISR) InitSelfTestReq Mask */
#define IP1553_ISR_STR(value)                 (IP1553_ISR_STR_Msk & ((value) << IP1553_ISR_STR_Pos))
#define IP1553_ISR_TSR_Pos                    _U_(17)                                              /**< (IP1553_ISR) TranShutdownReq Position */
#define IP1553_ISR_TSR_Msk                    (_U_(0x1) << IP1553_ISR_TSR_Pos)                     /**< (IP1553_ISR) TranShutdownReq Mask */
#define IP1553_ISR_TSR(value)                 (IP1553_ISR_TSR_Msk & ((value) << IP1553_ISR_TSR_Pos))
#define IP1553_ISR_OSR_Pos                    _U_(18)                                              /**< (IP1553_ISR) OvTranShutdownReq Position */
#define IP1553_ISR_OSR_Msk                    (_U_(0x1) << IP1553_ISR_OSR_Pos)                     /**< (IP1553_ISR) OvTranShutdownReq Mask */
#define IP1553_ISR_OSR(value)                 (IP1553_ISR_OSR_Msk & ((value) << IP1553_ISR_OSR_Pos))
#define IP1553_ISR_SDR_Pos                    _U_(19)                                              /**< (IP1553_ISR) SyncWithDataReq Position */
#define IP1553_ISR_SDR_Msk                    (_U_(0x1) << IP1553_ISR_SDR_Pos)                     /**< (IP1553_ISR) SyncWithDataReq Mask */
#define IP1553_ISR_SDR(value)                 (IP1553_ISR_SDR_Msk & ((value) << IP1553_ISR_SDR_Pos))
#define IP1553_ISR_SWD_Pos                    _U_(20)                                              /**< (IP1553_ISR) SyncWithoutDataReq Position */
#define IP1553_ISR_SWD_Msk                    (_U_(0x1) << IP1553_ISR_SWD_Pos)                     /**< (IP1553_ISR) SyncWithoutDataReq Mask */
#define IP1553_ISR_SWD(value)                 (IP1553_ISR_SWD_Msk & ((value) << IP1553_ISR_SWD_Pos))
#define IP1553_ISR_RRT_Pos                    _U_(21)                                              /**< (IP1553_ISR) ResetRTReq Position */
#define IP1553_ISR_RRT_Msk                    (_U_(0x1) << IP1553_ISR_RRT_Pos)                     /**< (IP1553_ISR) ResetRTReq Mask */
#define IP1553_ISR_RRT(value)                 (IP1553_ISR_RRT_Msk & ((value) << IP1553_ISR_RRT_Pos))
#define IP1553_ISR_ITF_Pos                    _U_(22)                                              /**< (IP1553_ISR) InhibitTermFlagReq Position */
#define IP1553_ISR_ITF_Msk                    (_U_(0x1) << IP1553_ISR_ITF_Pos)                     /**< (IP1553_ISR) InhibitTermFlagReq Mask */
#define IP1553_ISR_ITF(value)                 (IP1553_ISR_ITF_Msk & ((value) << IP1553_ISR_ITF_Pos))
#define IP1553_ISR_OTF_Pos                    _U_(23)                                              /**< (IP1553_ISR) OvInhibitTermFlagReq Position */
#define IP1553_ISR_OTF_Msk                    (_U_(0x1) << IP1553_ISR_OTF_Pos)                     /**< (IP1553_ISR) OvInhibitTermFlagReq Mask */
#define IP1553_ISR_OTF(value)                 (IP1553_ISR_OTF_Msk & ((value) << IP1553_ISR_OTF_Pos))
#define IP1553_ISR_IPB_Pos                    _U_(24)                                              /**< (IP1553_ISR) IPBusy Position */
#define IP1553_ISR_IPB_Msk                    (_U_(0x1) << IP1553_ISR_IPB_Pos)                     /**< (IP1553_ISR) IPBusy Mask */
#define IP1553_ISR_IPB(value)                 (IP1553_ISR_IPB_Msk & ((value) << IP1553_ISR_IPB_Pos))
#define IP1553_ISR_Msk                        _U_(0x01FFFFFF)                                      /**< (IP1553_ISR) Register Mask  */


