Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/ip1553.h
#define IP1553_RXBSR_RE_Pos                   _U_(0)                                               /**< (IP1553_RXBSR Position) Receive Buffer, 3x with x=[x-3x] */
#define IP1553_RXBSR_RE_Msk                   (_U_(0xFFFFFFFF) << IP1553_RXBSR_RE_Pos)             /**< (IP1553_RXBSR Mask) RE */
#define IP1553_RXBSR_RE(value)                (IP1553_RXBSR_RE_Msk & ((value) << IP1553_RXBSR_RE_Pos)) 

/* -------- IP1553_RXBAER : (IP1553 Offset: 0x48) (R/W 32) Rx Buffer Access Error Register -------- */
#define IP1553_RXBAER_RER0_Pos                _U_(0)                                               /**< (IP1553_RXBAER) Receive error 0, x with x=[0-31] Position */
#define IP1553_RXBAER_RER0_Msk                (_U_(0x1) << IP1553_RXBAER_RER0_Pos)                 /**< (IP1553_RXBAER) Receive error 0, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER0(value)             (IP1553_RXBAER_RER0_Msk & ((value) << IP1553_RXBAER_RER0_Pos))
#define IP1553_RXBAER_RER1_Pos                _U_(1)                                               /**< (IP1553_RXBAER) Receive error 1, x with x=[0-31] Position */
#define IP1553_RXBAER_RER1_Msk                (_U_(0x1) << IP1553_RXBAER_RER1_Pos)                 /**< (IP1553_RXBAER) Receive error 1, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER1(value)             (IP1553_RXBAER_RER1_Msk & ((value) << IP1553_RXBAER_RER1_Pos))
#define IP1553_RXBAER_RER2_Pos                _U_(2)                                               /**< (IP1553_RXBAER) Receive error 2, x with x=[0-31] Position */
#define IP1553_RXBAER_RER2_Msk                (_U_(0x1) << IP1553_RXBAER_RER2_Pos)                 /**< (IP1553_RXBAER) Receive error 2, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER2(value)             (IP1553_RXBAER_RER2_Msk & ((value) << IP1553_RXBAER_RER2_Pos))
#define IP1553_RXBAER_RER3_Pos                _U_(3)                                               /**< (IP1553_RXBAER) Receive error 3, x with x=[0-31] Position */
#define IP1553_RXBAER_RER3_Msk                (_U_(0x1) << IP1553_RXBAER_RER3_Pos)                 /**< (IP1553_RXBAER) Receive error 3, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER3(value)             (IP1553_RXBAER_RER3_Msk & ((value) << IP1553_RXBAER_RER3_Pos))
#define IP1553_RXBAER_RER4_Pos                _U_(4)                                               /**< (IP1553_RXBAER) Receive error 4, x with x=[0-31] Position */
#define IP1553_RXBAER_RER4_Msk                (_U_(0x1) << IP1553_RXBAER_RER4_Pos)                 /**< (IP1553_RXBAER) Receive error 4, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER4(value)             (IP1553_RXBAER_RER4_Msk & ((value) << IP1553_RXBAER_RER4_Pos))
#define IP1553_RXBAER_RER5_Pos                _U_(5)                                               /**< (IP1553_RXBAER) Receive error 5, x with x=[0-31] Position */
#define IP1553_RXBAER_RER5_Msk                (_U_(0x1) << IP1553_RXBAER_RER5_Pos)                 /**< (IP1553_RXBAER) Receive error 5, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER5(value)             (IP1553_RXBAER_RER5_Msk & ((value) << IP1553_RXBAER_RER5_Pos))
#define IP1553_RXBAER_RER6_Pos                _U_(6)                                               /**< (IP1553_RXBAER) Receive error 6, x with x=[0-31] Position */
#define IP1553_RXBAER_RER6_Msk                (_U_(0x1) << IP1553_RXBAER_RER6_Pos)                 /**< (IP1553_RXBAER) Receive error 6, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER6(value)             (IP1553_RXBAER_RER6_Msk & ((value) << IP1553_RXBAER_RER6_Pos))
#define IP1553_RXBAER_RER7_Pos                _U_(7)                                               /**< (IP1553_RXBAER) Receive error 7, x with x=[0-31] Position */
#define IP1553_RXBAER_RER7_Msk                (_U_(0x1) << IP1553_RXBAER_RER7_Pos)                 /**< (IP1553_RXBAER) Receive error 7, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER7(value)             (IP1553_RXBAER_RER7_Msk & ((value) << IP1553_RXBAER_RER7_Pos))
#define IP1553_RXBAER_RER8_Pos                _U_(8)                                               /**< (IP1553_RXBAER) Receive error 8, x with x=[0-31] Position */
#define IP1553_RXBAER_RER8_Msk                (_U_(0x1) << IP1553_RXBAER_RER8_Pos)                 /**< (IP1553_RXBAER) Receive error 8, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER8(value)             (IP1553_RXBAER_RER8_Msk & ((value) << IP1553_RXBAER_RER8_Pos))
#define IP1553_RXBAER_RER9_Pos                _U_(9)                                               /**< (IP1553_RXBAER) Receive error 9, x with x=[0-31] Position */
#define IP1553_RXBAER_RER9_Msk                (_U_(0x1) << IP1553_RXBAER_RER9_Pos)                 /**< (IP1553_RXBAER) Receive error 9, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER9(value)             (IP1553_RXBAER_RER9_Msk & ((value) << IP1553_RXBAER_RER9_Pos))
#define IP1553_RXBAER_RER10_Pos               _U_(10)                                              /**< (IP1553_RXBAER) Receive error 10, x with x=[0-31] Position */
#define IP1553_RXBAER_RER10_Msk               (_U_(0x1) << IP1553_RXBAER_RER10_Pos)                /**< (IP1553_RXBAER) Receive error 10, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER10(value)            (IP1553_RXBAER_RER10_Msk & ((value) << IP1553_RXBAER_RER10_Pos))
#define IP1553_RXBAER_RER11_Pos               _U_(11)                                              /**< (IP1553_RXBAER) Receive error 11, x with x=[0-31] Position */
#define IP1553_RXBAER_RER11_Msk               (_U_(0x1) << IP1553_RXBAER_RER11_Pos)                /**< (IP1553_RXBAER) Receive error 11, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER11(value)            (IP1553_RXBAER_RER11_Msk & ((value) << IP1553_RXBAER_RER11_Pos))
#define IP1553_RXBAER_RER12_Pos               _U_(12)                                              /**< (IP1553_RXBAER) Receive error 12, x with x=[0-31] Position */
#define IP1553_RXBAER_RER12_Msk               (_U_(0x1) << IP1553_RXBAER_RER12_Pos)                /**< (IP1553_RXBAER) Receive error 12, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER12(value)            (IP1553_RXBAER_RER12_Msk & ((value) << IP1553_RXBAER_RER12_Pos))
#define IP1553_RXBAER_RER13_Pos               _U_(13)                                              /**< (IP1553_RXBAER) Receive error 13, x with x=[0-31] Position */
#define IP1553_RXBAER_RER13_Msk               (_U_(0x1) << IP1553_RXBAER_RER13_Pos)                /**< (IP1553_RXBAER) Receive error 13, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER13(value)            (IP1553_RXBAER_RER13_Msk & ((value) << IP1553_RXBAER_RER13_Pos))
#define IP1553_RXBAER_RER14_Pos               _U_(14)                                              /**< (IP1553_RXBAER) Receive error 14, x with x=[0-31] Position */
#define IP1553_RXBAER_RER14_Msk               (_U_(0x1) << IP1553_RXBAER_RER14_Pos)                /**< (IP1553_RXBAER) Receive error 14, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER14(value)            (IP1553_RXBAER_RER14_Msk & ((value) << IP1553_RXBAER_RER14_Pos))
#define IP1553_RXBAER_RER15_Pos               _U_(15)                                              /**< (IP1553_RXBAER) Receive error 15, x with x=[0-31] Position */
#define IP1553_RXBAER_RER15_Msk               (_U_(0x1) << IP1553_RXBAER_RER15_Pos)                /**< (IP1553_RXBAER) Receive error 15, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER15(value)            (IP1553_RXBAER_RER15_Msk & ((value) << IP1553_RXBAER_RER15_Pos))
#define IP1553_RXBAER_RER16_Pos               _U_(16)                                              /**< (IP1553_RXBAER) Receive error 16, x with x=[0-31] Position */
#define IP1553_RXBAER_RER16_Msk               (_U_(0x1) << IP1553_RXBAER_RER16_Pos)                /**< (IP1553_RXBAER) Receive error 16, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER16(value)            (IP1553_RXBAER_RER16_Msk & ((value) << IP1553_RXBAER_RER16_Pos))
#define IP1553_RXBAER_RER17_Pos               _U_(17)                                              /**< (IP1553_RXBAER) Receive error 17, x with x=[0-31] Position */
#define IP1553_RXBAER_RER17_Msk               (_U_(0x1) << IP1553_RXBAER_RER17_Pos)                /**< (IP1553_RXBAER) Receive error 17, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER17(value)            (IP1553_RXBAER_RER17_Msk & ((value) << IP1553_RXBAER_RER17_Pos))
#define IP1553_RXBAER_RER18_Pos               _U_(18)                                              /**< (IP1553_RXBAER) Receive error 18, x with x=[0-31] Position */
#define IP1553_RXBAER_RER18_Msk               (_U_(0x1) << IP1553_RXBAER_RER18_Pos)                /**< (IP1553_RXBAER) Receive error 18, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER18(value)            (IP1553_RXBAER_RER18_Msk & ((value) << IP1553_RXBAER_RER18_Pos))
#define IP1553_RXBAER_RER19_Pos               _U_(19)                                              /**< (IP1553_RXBAER) Receive error 19, x with x=[0-31] Position */
#define IP1553_RXBAER_RER19_Msk               (_U_(0x1) << IP1553_RXBAER_RER19_Pos)                /**< (IP1553_RXBAER) Receive error 19, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER19(value)            (IP1553_RXBAER_RER19_Msk & ((value) << IP1553_RXBAER_RER19_Pos))
#define IP1553_RXBAER_RER20_Pos               _U_(20)                                              /**< (IP1553_RXBAER) Receive error 20, x with x=[0-31] Position */
#define IP1553_RXBAER_RER20_Msk               (_U_(0x1) << IP1553_RXBAER_RER20_Pos)                /**< (IP1553_RXBAER) Receive error 20, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER20(value)            (IP1553_RXBAER_RER20_Msk & ((value) << IP1553_RXBAER_RER20_Pos))
#define IP1553_RXBAER_RER21_Pos               _U_(21)                                              /**< (IP1553_RXBAER) Receive error 21, x with x=[0-31] Position */
#define IP1553_RXBAER_RER21_Msk               (_U_(0x1) << IP1553_RXBAER_RER21_Pos)                /**< (IP1553_RXBAER) Receive error 21, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER21(value)            (IP1553_RXBAER_RER21_Msk & ((value) << IP1553_RXBAER_RER21_Pos))
#define IP1553_RXBAER_RER22_Pos               _U_(22)                                              /**< (IP1553_RXBAER) Receive error 22, x with x=[0-31] Position */
#define IP1553_RXBAER_RER22_Msk               (_U_(0x1) << IP1553_RXBAER_RER22_Pos)                /**< (IP1553_RXBAER) Receive error 22, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER22(value)            (IP1553_RXBAER_RER22_Msk & ((value) << IP1553_RXBAER_RER22_Pos))
#define IP1553_RXBAER_RER23_Pos               _U_(23)                                              /**< (IP1553_RXBAER) Receive error 23, x with x=[0-31] Position */
#define IP1553_RXBAER_RER23_Msk               (_U_(0x1) << IP1553_RXBAER_RER23_Pos)                /**< (IP1553_RXBAER) Receive error 23, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER23(value)            (IP1553_RXBAER_RER23_Msk & ((value) << IP1553_RXBAER_RER23_Pos))
#define IP1553_RXBAER_RER24_Pos               _U_(24)                                              /**< (IP1553_RXBAER) Receive error 24, x with x=[0-31] Position */
#define IP1553_RXBAER_RER24_Msk               (_U_(0x1) << IP1553_RXBAER_RER24_Pos)                /**< (IP1553_RXBAER) Receive error 24, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER24(value)            (IP1553_RXBAER_RER24_Msk & ((value) << IP1553_RXBAER_RER24_Pos))
#define IP1553_RXBAER_RER25_Pos               _U_(25)                                              /**< (IP1553_RXBAER) Receive error 25, x with x=[0-31] Position */
#define IP1553_RXBAER_RER25_Msk               (_U_(0x1) << IP1553_RXBAER_RER25_Pos)                /**< (IP1553_RXBAER) Receive error 25, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER25(value)            (IP1553_RXBAER_RER25_Msk & ((value) << IP1553_RXBAER_RER25_Pos))
#define IP1553_RXBAER_RER26_Pos               _U_(26)                                              /**< (IP1553_RXBAER) Receive error 26, x with x=[0-31] Position */
#define IP1553_RXBAER_RER26_Msk               (_U_(0x1) << IP1553_RXBAER_RER26_Pos)                /**< (IP1553_RXBAER) Receive error 26, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER26(value)            (IP1553_RXBAER_RER26_Msk & ((value) << IP1553_RXBAER_RER26_Pos))
#define IP1553_RXBAER_RER27_Pos               _U_(27)                                              /**< (IP1553_RXBAER) Receive error 27, x with x=[0-31] Position */
#define IP1553_RXBAER_RER27_Msk               (_U_(0x1) << IP1553_RXBAER_RER27_Pos)                /**< (IP1553_RXBAER) Receive error 27, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER27(value)            (IP1553_RXBAER_RER27_Msk & ((value) << IP1553_RXBAER_RER27_Pos))
#define IP1553_RXBAER_RER28_Pos               _U_(28)                                              /**< (IP1553_RXBAER) Receive error 28, x with x=[0-31] Position */
#define IP1553_RXBAER_RER28_Msk               (_U_(0x1) << IP1553_RXBAER_RER28_Pos)                /**< (IP1553_RXBAER) Receive error 28, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER28(value)            (IP1553_RXBAER_RER28_Msk & ((value) << IP1553_RXBAER_RER28_Pos))
#define IP1553_RXBAER_RER29_Pos               _U_(29)                                              /**< (IP1553_RXBAER) Receive error 29, x with x=[0-31] Position */
#define IP1553_RXBAER_RER29_Msk               (_U_(0x1) << IP1553_RXBAER_RER29_Pos)                /**< (IP1553_RXBAER) Receive error 29, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER29(value)            (IP1553_RXBAER_RER29_Msk & ((value) << IP1553_RXBAER_RER29_Pos))
#define IP1553_RXBAER_RER30_Pos               _U_(30)                                              /**< (IP1553_RXBAER) Receive error 30, x with x=[0-31] Position */
#define IP1553_RXBAER_RER30_Msk               (_U_(0x1) << IP1553_RXBAER_RER30_Pos)                /**< (IP1553_RXBAER) Receive error 30, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER30(value)            (IP1553_RXBAER_RER30_Msk & ((value) << IP1553_RXBAER_RER30_Pos))
#define IP1553_RXBAER_RER31_Pos               _U_(31)                                              /**< (IP1553_RXBAER) Receive error 31, x with x=[0-31] Position */
#define IP1553_RXBAER_RER31_Msk               (_U_(0x1) << IP1553_RXBAER_RER31_Pos)                /**< (IP1553_RXBAER) Receive error 31, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER31(value)            (IP1553_RXBAER_RER31_Msk & ((value) << IP1553_RXBAER_RER31_Pos))
#define IP1553_RXBAER_Msk                     _U_(0xFFFFFFFF)                                      /**< (IP1553_RXBAER) Register Mask  */

#define IP1553_RXBAER_RER_Pos                 _U_(0)                                               /**< (IP1553_RXBAER Position) Receive error 3x, x with x=[x-3x] */
#define IP1553_RXBAER_RER_Msk                 (_U_(0xFFFFFFFF) << IP1553_RXBAER_RER_Pos)           /**< (IP1553_RXBAER Mask) RER */
#define IP1553_RXBAER_RER(value)              (IP1553_RXBAER_RER_Msk & ((value) << IP1553_RXBAER_RER_Pos)) 

