Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/ip1553.h
/* -------- IP1553_TXBSR : (IP1553 Offset: 0x4C) (R/W 32) Tx Buffer Status Register -------- */
#define IP1553_TXBSR_TF0_Pos                  _U_(0)                                               /**< (IP1553_TXBSR) Transmit buffer 0, x with x=[0-31] Position */
#define IP1553_TXBSR_TF0_Msk                  (_U_(0x1) << IP1553_TXBSR_TF0_Pos)                   /**< (IP1553_TXBSR) Transmit buffer 0, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF0(value)               (IP1553_TXBSR_TF0_Msk & ((value) << IP1553_TXBSR_TF0_Pos))
#define IP1553_TXBSR_TF1_Pos                  _U_(1)                                               /**< (IP1553_TXBSR) Transmit buffer 1, x with x=[0-31] Position */
#define IP1553_TXBSR_TF1_Msk                  (_U_(0x1) << IP1553_TXBSR_TF1_Pos)                   /**< (IP1553_TXBSR) Transmit buffer 1, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF1(value)               (IP1553_TXBSR_TF1_Msk & ((value) << IP1553_TXBSR_TF1_Pos))
#define IP1553_TXBSR_TF2_Pos                  _U_(2)                                               /**< (IP1553_TXBSR) Transmit buffer 2, x with x=[0-31] Position */
#define IP1553_TXBSR_TF2_Msk                  (_U_(0x1) << IP1553_TXBSR_TF2_Pos)                   /**< (IP1553_TXBSR) Transmit buffer 2, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF2(value)               (IP1553_TXBSR_TF2_Msk & ((value) << IP1553_TXBSR_TF2_Pos))
#define IP1553_TXBSR_TF3_Pos                  _U_(3)                                               /**< (IP1553_TXBSR) Transmit buffer 3, x with x=[0-31] Position */
#define IP1553_TXBSR_TF3_Msk                  (_U_(0x1) << IP1553_TXBSR_TF3_Pos)                   /**< (IP1553_TXBSR) Transmit buffer 3, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF3(value)               (IP1553_TXBSR_TF3_Msk & ((value) << IP1553_TXBSR_TF3_Pos))
#define IP1553_TXBSR_TF4_Pos                  _U_(4)                                               /**< (IP1553_TXBSR) Transmit buffer 4, x with x=[0-31] Position */
#define IP1553_TXBSR_TF4_Msk                  (_U_(0x1) << IP1553_TXBSR_TF4_Pos)                   /**< (IP1553_TXBSR) Transmit buffer 4, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF4(value)               (IP1553_TXBSR_TF4_Msk & ((value) << IP1553_TXBSR_TF4_Pos))
#define IP1553_TXBSR_TF5_Pos                  _U_(5)                                               /**< (IP1553_TXBSR) Transmit buffer 5, x with x=[0-31] Position */
#define IP1553_TXBSR_TF5_Msk                  (_U_(0x1) << IP1553_TXBSR_TF5_Pos)                   /**< (IP1553_TXBSR) Transmit buffer 5, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF5(value)               (IP1553_TXBSR_TF5_Msk & ((value) << IP1553_TXBSR_TF5_Pos))
#define IP1553_TXBSR_TF6_Pos                  _U_(6)                                               /**< (IP1553_TXBSR) Transmit buffer 6, x with x=[0-31] Position */
#define IP1553_TXBSR_TF6_Msk                  (_U_(0x1) << IP1553_TXBSR_TF6_Pos)                   /**< (IP1553_TXBSR) Transmit buffer 6, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF6(value)               (IP1553_TXBSR_TF6_Msk & ((value) << IP1553_TXBSR_TF6_Pos))
#define IP1553_TXBSR_TF7_Pos                  _U_(7)                                               /**< (IP1553_TXBSR) Transmit buffer 7, x with x=[0-31] Position */
#define IP1553_TXBSR_TF7_Msk                  (_U_(0x1) << IP1553_TXBSR_TF7_Pos)                   /**< (IP1553_TXBSR) Transmit buffer 7, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF7(value)               (IP1553_TXBSR_TF7_Msk & ((value) << IP1553_TXBSR_TF7_Pos))
#define IP1553_TXBSR_TF8_Pos                  _U_(8)                                               /**< (IP1553_TXBSR) Transmit buffer 8, x with x=[0-31] Position */
#define IP1553_TXBSR_TF8_Msk                  (_U_(0x1) << IP1553_TXBSR_TF8_Pos)                   /**< (IP1553_TXBSR) Transmit buffer 8, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF8(value)               (IP1553_TXBSR_TF8_Msk & ((value) << IP1553_TXBSR_TF8_Pos))
#define IP1553_TXBSR_TF9_Pos                  _U_(9)                                               /**< (IP1553_TXBSR) Transmit buffer 9, x with x=[0-31] Position */
#define IP1553_TXBSR_TF9_Msk                  (_U_(0x1) << IP1553_TXBSR_TF9_Pos)                   /**< (IP1553_TXBSR) Transmit buffer 9, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF9(value)               (IP1553_TXBSR_TF9_Msk & ((value) << IP1553_TXBSR_TF9_Pos))
#define IP1553_TXBSR_TF10_Pos                 _U_(10)                                              /**< (IP1553_TXBSR) Transmit buffer 10, x with x=[0-31] Position */
#define IP1553_TXBSR_TF10_Msk                 (_U_(0x1) << IP1553_TXBSR_TF10_Pos)                  /**< (IP1553_TXBSR) Transmit buffer 10, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF10(value)              (IP1553_TXBSR_TF10_Msk & ((value) << IP1553_TXBSR_TF10_Pos))
#define IP1553_TXBSR_TF11_Pos                 _U_(11)                                              /**< (IP1553_TXBSR) Transmit buffer 11, x with x=[0-31] Position */
#define IP1553_TXBSR_TF11_Msk                 (_U_(0x1) << IP1553_TXBSR_TF11_Pos)                  /**< (IP1553_TXBSR) Transmit buffer 11, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF11(value)              (IP1553_TXBSR_TF11_Msk & ((value) << IP1553_TXBSR_TF11_Pos))
#define IP1553_TXBSR_TF12_Pos                 _U_(12)                                              /**< (IP1553_TXBSR) Transmit buffer 12, x with x=[0-31] Position */
#define IP1553_TXBSR_TF12_Msk                 (_U_(0x1) << IP1553_TXBSR_TF12_Pos)                  /**< (IP1553_TXBSR) Transmit buffer 12, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF12(value)              (IP1553_TXBSR_TF12_Msk & ((value) << IP1553_TXBSR_TF12_Pos))
#define IP1553_TXBSR_TF13_Pos                 _U_(13)                                              /**< (IP1553_TXBSR) Transmit buffer 13, x with x=[0-31] Position */
#define IP1553_TXBSR_TF13_Msk                 (_U_(0x1) << IP1553_TXBSR_TF13_Pos)                  /**< (IP1553_TXBSR) Transmit buffer 13, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF13(value)              (IP1553_TXBSR_TF13_Msk & ((value) << IP1553_TXBSR_TF13_Pos))
#define IP1553_TXBSR_TF14_Pos                 _U_(14)                                              /**< (IP1553_TXBSR) Transmit buffer 14, x with x=[0-31] Position */
#define IP1553_TXBSR_TF14_Msk                 (_U_(0x1) << IP1553_TXBSR_TF14_Pos)                  /**< (IP1553_TXBSR) Transmit buffer 14, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF14(value)              (IP1553_TXBSR_TF14_Msk & ((value) << IP1553_TXBSR_TF14_Pos))
#define IP1553_TXBSR_TF15_Pos                 _U_(15)                                              /**< (IP1553_TXBSR) Transmit buffer 15, x with x=[0-31] Position */
#define IP1553_TXBSR_TF15_Msk                 (_U_(0x1) << IP1553_TXBSR_TF15_Pos)                  /**< (IP1553_TXBSR) Transmit buffer 15, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF15(value)              (IP1553_TXBSR_TF15_Msk & ((value) << IP1553_TXBSR_TF15_Pos))
#define IP1553_TXBSR_TF16_Pos                 _U_(16)                                              /**< (IP1553_TXBSR) Transmit buffer 16, x with x=[0-31] Position */
#define IP1553_TXBSR_TF16_Msk                 (_U_(0x1) << IP1553_TXBSR_TF16_Pos)                  /**< (IP1553_TXBSR) Transmit buffer 16, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF16(value)              (IP1553_TXBSR_TF16_Msk & ((value) << IP1553_TXBSR_TF16_Pos))
#define IP1553_TXBSR_TF17_Pos                 _U_(17)                                              /**< (IP1553_TXBSR) Transmit buffer 17, x with x=[0-31] Position */
#define IP1553_TXBSR_TF17_Msk                 (_U_(0x1) << IP1553_TXBSR_TF17_Pos)                  /**< (IP1553_TXBSR) Transmit buffer 17, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF17(value)              (IP1553_TXBSR_TF17_Msk & ((value) << IP1553_TXBSR_TF17_Pos))
#define IP1553_TXBSR_TF18_Pos                 _U_(18)                                              /**< (IP1553_TXBSR) Transmit buffer 18, x with x=[0-31] Position */
#define IP1553_TXBSR_TF18_Msk                 (_U_(0x1) << IP1553_TXBSR_TF18_Pos)                  /**< (IP1553_TXBSR) Transmit buffer 18, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF18(value)              (IP1553_TXBSR_TF18_Msk & ((value) << IP1553_TXBSR_TF18_Pos))
#define IP1553_TXBSR_TF19_Pos                 _U_(19)                                              /**< (IP1553_TXBSR) Transmit buffer 19, x with x=[0-31] Position */
#define IP1553_TXBSR_TF19_Msk                 (_U_(0x1) << IP1553_TXBSR_TF19_Pos)                  /**< (IP1553_TXBSR) Transmit buffer 19, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF19(value)              (IP1553_TXBSR_TF19_Msk & ((value) << IP1553_TXBSR_TF19_Pos))
#define IP1553_TXBSR_TF20_Pos                 _U_(20)                                              /**< (IP1553_TXBSR) Transmit buffer 20, x with x=[0-31] Position */
#define IP1553_TXBSR_TF20_Msk                 (_U_(0x1) << IP1553_TXBSR_TF20_Pos)                  /**< (IP1553_TXBSR) Transmit buffer 20, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF20(value)              (IP1553_TXBSR_TF20_Msk & ((value) << IP1553_TXBSR_TF20_Pos))
#define IP1553_TXBSR_TF21_Pos                 _U_(21)                                              /**< (IP1553_TXBSR) Transmit buffer 21, x with x=[0-31] Position */
#define IP1553_TXBSR_TF21_Msk                 (_U_(0x1) << IP1553_TXBSR_TF21_Pos)                  /**< (IP1553_TXBSR) Transmit buffer 21, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF21(value)              (IP1553_TXBSR_TF21_Msk & ((value) << IP1553_TXBSR_TF21_Pos))
#define IP1553_TXBSR_TF22_Pos                 _U_(22)                                              /**< (IP1553_TXBSR) Transmit buffer 22, x with x=[0-31] Position */
#define IP1553_TXBSR_TF22_Msk                 (_U_(0x1) << IP1553_TXBSR_TF22_Pos)                  /**< (IP1553_TXBSR) Transmit buffer 22, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF22(value)              (IP1553_TXBSR_TF22_Msk & ((value) << IP1553_TXBSR_TF22_Pos))
#define IP1553_TXBSR_TF23_Pos                 _U_(23)                                              /**< (IP1553_TXBSR) Transmit buffer 23, x with x=[0-31] Position */
#define IP1553_TXBSR_TF23_Msk                 (_U_(0x1) << IP1553_TXBSR_TF23_Pos)                  /**< (IP1553_TXBSR) Transmit buffer 23, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF23(value)              (IP1553_TXBSR_TF23_Msk & ((value) << IP1553_TXBSR_TF23_Pos))
#define IP1553_TXBSR_TF24_Pos                 _U_(24)                                              /**< (IP1553_TXBSR) Transmit buffer 24, x with x=[0-31] Position */
#define IP1553_TXBSR_TF24_Msk                 (_U_(0x1) << IP1553_TXBSR_TF24_Pos)                  /**< (IP1553_TXBSR) Transmit buffer 24, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF24(value)              (IP1553_TXBSR_TF24_Msk & ((value) << IP1553_TXBSR_TF24_Pos))
#define IP1553_TXBSR_TF25_Pos                 _U_(25)                                              /**< (IP1553_TXBSR) Transmit buffer 25, x with x=[0-31] Position */
#define IP1553_TXBSR_TF25_Msk                 (_U_(0x1) << IP1553_TXBSR_TF25_Pos)                  /**< (IP1553_TXBSR) Transmit buffer 25, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF25(value)              (IP1553_TXBSR_TF25_Msk & ((value) << IP1553_TXBSR_TF25_Pos))
#define IP1553_TXBSR_TF26_Pos                 _U_(26)                                              /**< (IP1553_TXBSR) Transmit buffer 26, x with x=[0-31] Position */
#define IP1553_TXBSR_TF26_Msk                 (_U_(0x1) << IP1553_TXBSR_TF26_Pos)                  /**< (IP1553_TXBSR) Transmit buffer 26, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF26(value)              (IP1553_TXBSR_TF26_Msk & ((value) << IP1553_TXBSR_TF26_Pos))
#define IP1553_TXBSR_TF27_Pos                 _U_(27)                                              /**< (IP1553_TXBSR) Transmit buffer 27, x with x=[0-31] Position */
#define IP1553_TXBSR_TF27_Msk                 (_U_(0x1) << IP1553_TXBSR_TF27_Pos)                  /**< (IP1553_TXBSR) Transmit buffer 27, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF27(value)              (IP1553_TXBSR_TF27_Msk & ((value) << IP1553_TXBSR_TF27_Pos))
#define IP1553_TXBSR_TF28_Pos                 _U_(28)                                              /**< (IP1553_TXBSR) Transmit buffer 28, x with x=[0-31] Position */
#define IP1553_TXBSR_TF28_Msk                 (_U_(0x1) << IP1553_TXBSR_TF28_Pos)                  /**< (IP1553_TXBSR) Transmit buffer 28, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF28(value)              (IP1553_TXBSR_TF28_Msk & ((value) << IP1553_TXBSR_TF28_Pos))
#define IP1553_TXBSR_TF29_Pos                 _U_(29)                                              /**< (IP1553_TXBSR) Transmit buffer 29, x with x=[0-31] Position */
#define IP1553_TXBSR_TF29_Msk                 (_U_(0x1) << IP1553_TXBSR_TF29_Pos)                  /**< (IP1553_TXBSR) Transmit buffer 29, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF29(value)              (IP1553_TXBSR_TF29_Msk & ((value) << IP1553_TXBSR_TF29_Pos))
#define IP1553_TXBSR_TF30_Pos                 _U_(30)                                              /**< (IP1553_TXBSR) Transmit buffer 30, x with x=[0-31] Position */
#define IP1553_TXBSR_TF30_Msk                 (_U_(0x1) << IP1553_TXBSR_TF30_Pos)                  /**< (IP1553_TXBSR) Transmit buffer 30, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF30(value)              (IP1553_TXBSR_TF30_Msk & ((value) << IP1553_TXBSR_TF30_Pos))
#define IP1553_TXBSR_TF31_Pos                 _U_(31)                                              /**< (IP1553_TXBSR) Transmit buffer 31, x with x=[0-31] Position */
#define IP1553_TXBSR_TF31_Msk                 (_U_(0x1) << IP1553_TXBSR_TF31_Pos)                  /**< (IP1553_TXBSR) Transmit buffer 31, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF31(value)              (IP1553_TXBSR_TF31_Msk & ((value) << IP1553_TXBSR_TF31_Pos))
#define IP1553_TXBSR_Msk                      _U_(0xFFFFFFFF)                                      /**< (IP1553_TXBSR) Register Mask  */

#define IP1553_TXBSR_TF_Pos                   _U_(0)                                               /**< (IP1553_TXBSR Position) Transmit buffer 3x, x with x=[x-3x] */
#define IP1553_TXBSR_TF_Msk                   (_U_(0xFFFFFFFF) << IP1553_TXBSR_TF_Pos)             /**< (IP1553_TXBSR Mask) TF */
#define IP1553_TXBSR_TF(value)                (IP1553_TXBSR_TF_Msk & ((value) << IP1553_TXBSR_TF_Pos)) 

